Repository: algorb/thbook_ru
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: # scraps are usually in separate *.th2 files scrap s1 -author 2004 "Therion team"
ru_ru: # скрапы обычно находятся в отдельных *.th2 файлах scrap s1 -author 2004 "Команда Therion'а"

source: (1) Symbol is visible if all of the following is true:
ru_ru: (1) Символ отображается, если верно следующее:

source: (2) Some symbols are clipped by the scrap outline.
ru_ru: (2) Некоторые символы могут подрезаться абрисом скрапа.

source: (3) Ordering: Each symbol belongs to one of the following groups which are drawn consecutively:
ru_ru: Упорядочивание: каждый символ относится к одной из следующих групп, которые последовательно выводятся:

source: (A) * |title-pages <on/off>| = turn on/off title pages before each atlas chapter (A; default: |off|) * |nav-factor <factor>| = set atlas navigator zoom factor (A; default: |30|) * |nav-size <x-size> <y-size>| = set number of atlas pages in both directions of navigator (A; default: |2 2|) * |transparency <on/off>| = set transparency for the passages (underlying passages are also visible) (M, A; default: |on|) * |opacity <value>| = set opacity value (used if |transparency| is |on|).
ru_ru: (A). * |title-pages <on/off>| = включение/выключение титульных страниц перед каждой главой атласа (A; по умолчанию: |off|). * |nav-factor <фактор>| = установить коэффициент масштабирования\break навигатора атласа (A; по умолчанию: |30|). * |nav-size <x-размер> <y-размер>| = установить количество страниц атласа в обоих направлениях навигатора (A; по умолчанию: |2 2|). * |transparency <on/off>| = установить прозрачность для ходов (отображаются только видимые ходы) (M, A; по умолчанию: |on|). * |opacity <значение> | = установить значение непрозрачности (используется, если |transparent| установлен в |on|).

source: (BTW, why not to use precompiled Windows version?)
ru_ru: Кстати, почему бы не использовать\break предварительно скомпилированную версию для Windows?

source: (Cf. chapter { Data format}).
ru_ru: (смотрите главу { Формат данных}).

source: (Empty lines or lines starting with `|#|' are ignored; lines ending with a backslash continue on next line.) Currently supported initialization commands follow.
ru_ru: Пустые строки или строки,\break начинающиеся с `|#|', игнорируются, строки, заканчивающиеся на обратную косую черту, продолжаются в следующей строке. В настоящее время\break поддерживаются команды инициализации:

source: (Guess how to enter the line insertion mode, other than using the shortcut Ctrl-l.) Click where the first point should be, then drag the mouse with pressed left button and release it where the first control point should be.
ru_ru: (Угадайте, как войти в режим вставки линии кроме использования сочетания Ctrl-l.) Нажмите, где должна быть первая точка, затем перетащите мышь с нажатой левой кнопкой и отпустите ее в том месте, где должна быть первая контрольная точка.

source: (Hence |aligned A| means |shifted (xpart A * xpart U, ypart A * ypart U)|.) * set the { T} transformation variable
ru_ru: Следовательно, |aligned A| означает |shifted (xpart A * xpart U, ypart A * ypart U)|. * устанавливается переменная трансформации { T}

source: (If you answer this, you'll know, why XTherion will never be true WYSIWYG editor.
ru_ru: (Если вы ответите на это, вы узнаете, почему XTherion никогда не будет истинным редактором WYSIWYG.

source: (It's very similar concept to XML data representation.)
ru_ru: (это очень похоже на представление XML-данных).

source: (M, A) * |colo[u]r <item> <colour>| = customize colour for special map items (map-fg, map-bg, preview-above, preview-below, label).
ru_ru: (M, A). * |colo[u]r <элемент> <цвет>| = настроить цвет для специальных элементов карты (|map-fg|, |map-bg|, |preview-above|, |preview-below|, |label|).

source: (M, A) * |rotate <value>| = rotates the map (M, A; default: |0|) * |units <metric/imperial>| = set output units (M, A; default: |metric|) * |symbol-set <symbol-set>| = use |symbol-set| for all map symbols, if available.
ru_ru: (M, A). * |rotate <значение>| = вращает карту (M, A; по умолчанию: |0|). * |units <metric/imperial>| = установить единицы измерения (M, A; по\break умолчанию: |metric|). * |symbol-set <набор символов>| = использование |набора символов| для всех символов карты, если они доступны.

source: (M, A; default: |0 0|) * |own-pages <number>| = set number of own pages added before the first page of automatically generated pages in atlas mode (currently required for correct page numbering) (A; default: |0|) * |page-grid <on/off>| = show pages key plan (M; default: |off|)
ru_ru: (M, A; по умолчанию: |0 0|). * |own-pages <число> | = установить количество собственных страниц,\break добавленных до первой страницы автоматически созданных страниц в режиме атласа (в настоящее время требуется для правильной нумерации страниц) (A; по умолчанию: |0|). * |page-grid <on/off> | = показывать план страничных ключей (M; по\break умолчанию: |off|).

source: (M, A; default: |70|) * |surface <top/bottom/off>| = set the position of the surface bitmap above/below the map.
ru_ru: (M, A; по умолчанию: |70|). * |surface <top/bottom/off>| = установить положение растрового изображения выше/ниже карты.

source: (M, A; default: |70|) * |surface-opacity <value>| = set the surface bitmap opacity (used if |transparency| is |on|).
ru_ru: (M, A; по умолчанию: |70|). * |surface-opacity <значение>| = установить прозрачность растровой\break поверхности (используется, если |transparent| установлен в |on|).

source: (M, A; default: |off|) * |colo[u]r-legend <on/off>| = turn on/off legend of map-fg colours when map-fg is set to altitude, scrap or map (M, A) * |legend-columns <number>| = adjusts the number of legend columns (M, A; default: |2|) * |map-comment <string>| = optional comment displayed at the map header (M) * |statistics <explo/topo/carto/copyright all/off/number>| or * |statistics <explo/topo-length on/hide/off>| = display some basic statistics; if set to off, team members are sorted {5.4}alphabetically; otherwise according to their contribution to exploration and surveying (M, A; default: |off|) * |scale-bar <length> <units>| = set the length of the scale-bar (M, A) * |language <xx[_YY]>| = set output language.
ru_ru: (M, A; по умолчанию: |off|). * |colo[u]r-legend <on/off>| = показать/скрыть легенду цветов |map-fg|, когда |map-fg| установлен по высоте, скрапу или карте (M, A). * |legend-columns <число>| = указывает количество столбцов легенды (M, A; по умолчанию: |2|). * |map-comment <текст> | = необязательный комментарий, отображаемый в заголовке карты (M). * |statistics <explo/topo/carto/copyright all/off/number>| или * |statistics <explo/topo-length on/hide/off>| = отобразить некоторые основные статистические данные; если установлено значение |off|, то члены команды сортируются {5.4} в алфавитном порядке; в противном случае в зависимости от их вклада в работу (M, A; по умолчанию: |off|). * |scale-bar <длина> <единицы> | = установить длину шкалы (M, A). * |language <xx[_YY]>| = установить язык вывода.

source: (M, A; default: |off|) * |layers <on/off>| = enable/disable PDF 1.5 layers (M, A; default: |on|) * |grid <off/bottom/top>| = enable/disable grid (optionally coordinates' values may be also displayed) (M, A; default: |off|) * |cs <coordinate system>| = coordinate system for |origin| and |grid-origin| * |north <true/grid>| = specify default orientation of the map.
ru_ru: (M, A; по умолчанию: |off|). * |layers <on/off>| = включение/отключение слоев PDF 1.5 (M, A; по\break умолчанию: |on|). * |grid <off/bottom/top>| = отображать/скрыть сетку (опционально могут\break также отображаться значения координат) (M, A; по умолчанию: |off|). * |cs <система координат>| = система координат для |origin| и |grid-origin|. * |north <true/grid>| = указать ориентацию карты по умолчанию.

source: (M, A; default: |off|) * |origin <x> <y> <z> <units>| = set origin of atlas pages (M, A) * |origin-label <x-label> <y-label>| = set label for atlas page which has the lower left corner at the given origin coordinates.
ru_ru: (M, A; по умолчанию: |off|). * |origin <x> <y> <z> <единицы>| = установить начало страниц атласа (M, A). * |origin-label <x-метка> <y-метка>| = установить метку для страницы атласа, которая имеет указанные координаты нижнего левого угла.

source: (M, A; default: |off|) * |sketches <on/off>| = turn on/off displaying of morphed sketch bitmaps.
ru_ru: (M, A; по умолчанию: |off|). * |sketches <on/off>| = отображать/скрыть растровые изображения с эскизом подвергшимся морфингу.

source: (M; default: off) * |map-image <x> <y> <n/s/e/w/ne/nw/se/sw/center> <filename>| = include image specified by |<filename>| into map at location specified by |<x> <y>|.
ru_ru: (M; по\break умолчанию: |off|). * |map-image <x> <y> <n/s/e/w/ne/nw/se/sw/center> <имя файла>| =\break включить изображение, указанное в |<имя файла>| на карту в месте,\break указанном |<x> <y>|.

source: (M; default: |0 100 nw|) * |map-header-bg <on/off>| = when on, background of map header is filled with background color (e.g. to hide map grid).
ru_ru: (M; по умолчанию: |0 100 nw|). * |map-header-bg <on/off>| = когда включено, фон заголовка карты\break заполняется цветом фона (например, для скрытия сетки).

source: (See the |scrap| command for details.)
ru_ru: (для деталей смотрите команду |scrap|).

source: (Set |own-pages 0| and |title-pages off| to get the correct page numbers to be excluded.) Changes of |own-pages| or |title-pages| options don't affect page excluding.
ru_ru: (Установите |own-pages 0| и |title-pages off| чтобы получить корректные номера страниц после исключения). Изменения опций\break |own-pages| или |title-pages| не влияют на исключение страниц.

source: (The || is also used in the default map layout definition: |{{0}{100}{NW}{}}|).
ru_ru: (|| также\break используется в определении макета карты по умолчанию: |{{0}{100}{NW}{}}|).

source: (This is usual for cross sections.)
ru_ru: (это обычно используется для сечений).

source: (We should use actually virtual font |vpalatino| instead of |palatino|, which contains no kerning or ligatures, but pdfdoesn't support || command on virtual fonts.
ru_ru: (Мы должны использовать виртуальный шрифт |vpalatino| вместо |palatino|, который не содержит кернинга или лигатуры, но pdfне поддерживает команду || на виртуальных шрифтах.

source: (Which contains || or ||, see above.) For each record it calls the macro ||, which is responsible for data formatting.
ru_ru: Содержимое || и\break || смотрите выше. Для каждой записи || вызывает макрос ||, который отвечает за форматирование данных.

source: (note how to use the { destination} argument), or much simpler (if we don't need hyperlink features):
ru_ru: (обратите внимание, как использовать аргумент { destination}), или намного проще (если нам не нужны функции гиперссылки):

source: * 3D model is generated from 2D maps to get a realistic 3D model without entering too much data
ru_ru: * 3D-модель создается из 2D-карт, чтобы получить реалистичную\break трехмерную модель не вводя слишком много данных.

source: * distribution.
ru_ru: * дистрибутив.

source: * distribution with at least with Plain format, recent pdf, and ({https://www.tug.org}).
ru_ru: * дистрибутив с plain форматом , pdf, и \break ({https://www.tug.org}).

source: * {5.3}|filter <(on)/off>| = set whether continuations without comment/text should be filtered out.
ru_ru: * {5.3}|filter <(on)/off>| = указывает, следует ли продолжения (перспективы) без комментариев/текста фильтровать.

source: * {5.3}|surveys (on)/off| = exports raw list of caves when set |off|.
ru_ru: * {5.3}|surveys (on)/off| = экспортирует необработанный список пещер при\break установке |off|.

source: * {5.3}|symbol-colo[u]r <point/line/area/group/special> <symbol-type> <colour>| = change colour of particular symbol or group of symbols.Note: colour change currently applies to pattern fills only if (1) output format is PDF and (2) version is at least 1.000] (M, A)
ru_ru: * {5.3}|symbol-colo[u]r <point/line/area/group/special> <тип символа> <цвет>| = изменить цвет конкретного символа или группы символовПримечание: изменение цвета в настоящее время применяется к заполнению шаблона только в том случае, если (1) формат вывода PDF и (2) версия не ниже 1.000.]. (M, A).

source: * {5.4.1}|fonts-setup <tinysize> <smallsize> <normalsize> <largesize> <hugesize>| = specify size of the text in points.
ru_ru: * {5.4.1}|fonts-setup <tinysize> <smallsize> <normalsize> <largesize> <hugesize>| = указать размер текста в точечных символах.

source: * {5.4.1}|min-symbol-scale <scale>| = define minimal |<scale>|, from which points and lines are displayed on the map.
ru_ru: * {5.4.1}|min-symbol-scale <масштаб>| = определить минимальный |<масштаб>|, при котором точечные и линейные символы отображаются на карте.\break

source: * {5.4}multiline comments inside |comment| ... |endcomment| block are allowed in data and configuration files
ru_ru: * {5.4}Многострочные комментарии внутри |comment|\ ...\ |endcomment| блока\break разрешены в файлах данных и конфигурационных файлах.

source: * {5.4}|height <value>| = height of pit or wall:pit; available in as a numeric variable |ATTR__height|.
ru_ru: * {5.4}|height <значение>| = высота pit (колодца) или wall:pit (входного колодца); доступная в как числовая переменная |ATTR__height|.

source: * A one-line command is terminated by an end of line character.
ru_ru: * Однострочная команда завершается символом конца строки.

source: * All data are relative to survey station positions.
ru_ru: * Все данные привязываются к положениям пикетов съемки.

source: * Crtl+L = insert new line and enter an `insert line point' mode * LeftClick = insert line point (without control points) * Ctrl+LeftClick = insert line point very close to existing point (normally it's inserted right above closest existing point) * LeftClick + drag = insert line point (with control points) * hold Ctrl while dragging = fix the distance of previous control point * LeftClick + drag on the control point = move its position * RightClick on one of the previous points = selects the previous point while in insert mode (useful if you want to change also the direction of previous control point) * Esc or LeftClick on the last point = end the line insertion * LeftClick on the first line point = close the line and end line insertion
ru_ru: * Ctrl+L = вставить новую линию и войти в режим `вставка точек линии'; * щелчок левой кнопкой мыши = вставить точку линии (без контрольных точек) * Ctrl+щелчок левой кнопкой мыши = вставить точку линии очень близко к существующей точке (обычно она вставляется на ближайшую\break существующую точку); * щелчок левой кнопкой мыши+тянуть = вставить точку линии (с\break контрольными точками); * удерживать Ctrl при перемещении = изменить расстояние предыдущей контрольной точки; * щелчок левой кнопкой мыши+переместить контрольную точку =\break переместить ее положение; * щелчок правой кнопкой мыши на одной из предыдущих точек = выбирает предыдущую точку в режиме вставки (полезно, если вы хотите изменить также направление предыдущей контрольной точки); * Esc или щелчок левой кнопкой мыши на последней точке = завершение вставки линии; * щелчок левой кнопкой мыши на первой точке линии = замкнуть линию и завершить вставку линии.

source: * Ctrl+P = switch to `insert point' mode * LeftClick = insert point at given position * Ctrl+LeftClick = insert point very close to existing point (normally it will be inserted right above the closest point) * Esc = escape from the `inset point' mode
ru_ru: * Ctrl+P = переход в режим `вставки точки'; * щелчок левой кнопкой мыши = вставка точки в заданной позицию; * Ctrl+щелчок левой кнопкой мыши = вставка точки очень близко к\break существующей точке (обычно она будет вставлена на ближайшую точку); * Esc = выход из режим `вставки точки'.

source: * Ctrl+R = insert scrap
ru_ru: * Ctrl+R = вставить скрап.

source: * Ctrl+Z = undo * Ctrl+Y = redo * F9 = compile current project * to select object in the listbox using keyboard: switch using `Tab' into desired listbox; move with underlined cursor to desired object; press `Space' * PageUp/PageDown = scroll up/down in the side panel * Shift+PageUp/PageDown = scroll up/down in file commands window
ru_ru: * Ctrl+Z = отменить изменения; * Ctrl+Y = вернуть изменения; * F9 = компилировать текущий проект; * для выбора объекта в списке с помощью клавиатуры: переключайтесь с помощью `Tab' в желаемый список; перемещаться на нужный объект (объект подчеркивается); нажмите `Пробел'; * PageUp/PageDown = скролинг вверх/вниз в боковой панели; * Shift+PageUp/PageDown = скролинг вверх/вниз в окне Команды в файле.

source: * Download the sample data from Therion web page and unpack it somewhere on your computer's hard drive.
ru_ru: * Скачайте примеры данных с сайта Therion'а и распакуйте их на жесткий диск.

source: * GNU C/C++ compiler * GNU make * Perl * Python 2.7 or 3 * Tcl/Tk 8.4.3 and newer ({https://www.tcl.tk}) with { BWidget} widget set ({https://sourceforge.net/projects/tcllib/}) and optionally { tkImg} extension ({https://sourceforge.net/projects/tkimg/}).
ru_ru: * GNU C/C++ компилятор. * GNU make. * Perl. * Python 2.7 или 3. * Tcl/Tk 8.4.3 или новее ({https://www.tcl.tk}) с набором виджетов { BWidget} ({https://sourceforge.net/projects/tcllib/}) и необязательным расширением\break { tkImg} ({https://sourceforge.net/projects/tkimg/}).

source: * It's possible to add new output formats
ru_ru: * Можно добавить новые форматы вывода.

source: * LCDF Typetools if you want to use easy setup for custom fonts in PDF maps * { convert} and { identify} utilities from ImageMagick distribution, if you want to use warping of survey sketches.
ru_ru: * LCDF Typetools, если вы хотите использовать легкую настройку для\break пользовательских шрифтов в PDF-картах. * Утилиты { convert} и { identify} из дистрибутива ImageMagick, если вы хотите использовать деформирование эскизов.

source: * LCDF Typetools package ({https://www.lcdf.org/type/}) * ImageMagick distribution with { convert} and { identify} utilities, if you want to use warping of survey sketches.
ru_ru: * LCDF Typetools пакет ({https://www.lcdf.org/type/}). * ImageMagick дистрибутив с утилитами { convert} и { identify}, если вы хотите использовать деформирование эскизы съемок.

source: * LeftClick + drag = move line point * Ctrl+LeftClick + drag = move line point close to the existing point (normally it is moved right above closest existing point) * LeftClick on control point + drag = move control point
ru_ru: * щелчок левой кнопкой мыши+перемещение = перемещение точки линии; * Ctrl+щелчок левой кнопкой мыши+перемещение = перемещение точки линии близко к существующей точке (обычно она перемещается на\break ближайшую существующую точку); * щелчок левой кнопкой мыши на контрольной точке+перемещение =\break переместить контрольную точку.

source: * LeftClick + drag = move point * Ctrl+LeftClick + drag = move point close to the existing point (normally it is moved right above closest existing point) * LeftClick + drag on point arrows = change point orientation or sizes (according to given switches in Point control panel)
ru_ru: * щелчок левой кнопкой мыши+перетаскивание = перемещение точки; * Ctrl+щелчок левой кнопкой мыши+перетаскивание = перемещение точки близко к существующей точке (обычно она перемещается на ближайшую существующую точку); * щелчок левой кнопкой мыши+перетаскивание стрелок точки = изменение ориентации и/или размера точки (согласно заданным переключателям в панели управления точки).

source: * LeftClick = select object on the top * RightClick = select object right below the top object (useful when several points lie above each other)
ru_ru: * щелчок левой кнопкой мыши = выбрать верхний объект; * щелчок правой кнопкой мыши = выбрать объект под верхним объектом (полезно, когда несколько точек лежат друг над другом).

source: * Multi-line commands begin similarly to one line commands, but continue on subsequent lines until explicit command termination.
ru_ru: * Многострочные команды начинаются аналогично однострочным, но\break продолжаются на последующих строках до явного завершения команды.

source: * Non-linear transformation of the scrap which (1) moves joined points together, (2) doesn't move survey stations, (3) is continuous.
ru_ru: * Нелинейное преобразование скрапа, которое состоит из (1) перемещения соединенных вместе точек, (2) не перемещает станции съемки.

source: * Non-linear transformation of the scrap which (1) moves survey stations to their correct position, (2) is continuous.
ru_ru: * Нелинейное преобразование скрапа состоит из перемещения станций\break съемки в правильное положение.

source: * Open the file `thconfig' from the sample data directory in the `Compiler' window of XTherion * Press `F9' or `compile' in the menu to run Therion on the data---you'll get some messages from Therion, and .
ru_ru: Откройте файл `thconfig' из каталога примеров данных в окне `therion компилятор'. * Нажмите `F9' или `Компилировать' в меню для запуска Therion'а -- вы получите несколько сообщений от Therion'а, и .

source: * PDF maps and 3D model are created in the data directory.
ru_ru: PDF-карты и 3D-модель создаются в каталоге с данными.

source: * RightClick = scroll drawing area * Double RightClick on the image = move the image
ru_ru: * клик правой кнопкой мыши = скролинг области рисования; * двойной щелчок правой кнопкой мыши по изображению = перемещение изображения.

source: * Run XTherion (under Unix and MacOS X by typing `xtherion' in the command line, under Windows there is a shortcut in the { Start} menu).
ru_ru: * Запустите XTherion (под Unix и MacOS X введя в командной строке\break `xtherion', под Windows ярлык в меню { Пуск}).

source: * Tcl/Tk with { BWidget} and optionally { tkImg} extension.
ru_ru: * Tcl/Tk с { BWidget} и опциональным расширением { tkImg}.

source: * There are two kinds of commands.
ru_ru: * Есть два типа команд.

source: * There is strict separation of data and visualization.
ru_ru: * Строгое разделение данных и визуализации.

source: * Therion is not dependent on particular operating system, character encoding or input files editor; input files will remain human readable
ru_ru: * Therion не зависит от конкретной операционной системы, кодировки\break символов или редактора входных файлов; входные файлы останутся\break читабельными для человека.

source: * although the support for WYSIWYG is limited, you get what you want
ru_ru: * Хотя поддержка WYSIWYG ограничена, вы всегда можете получить то, что хотите.

source: * any PDF or SVG viewer displaying 2D maps; * any GIS supporting DXF or { shapefile} formats for analyzing the maps; * appropriate 3D viewer for models exported in other than default format; * any SQL database client to process exported database.
ru_ru: * любой просмотрщик PDF или SVG для просмотра 2D-карт; * любые GIS поддерживающие DXF или { shapefile} форматы для анализа карт; * соответствующий 3D просмотрщик для моделей, экспортированных в\break формате отличном от стандартного; * любой клиент базы данных SQL для обработки экспортированной базы данных.

source: * archive survey data on computer in a form as close to the original notes and sketches as possible and retrieve them in a flexible and efficient way; * draw a nice up-to-date plan or elevation map; * create a realistic 3D model of the cave.
ru_ru: * архивировать данные съемки на компьютере в форме, максимально\break приближенной к оригинальным записям и зарисовкам, и обрабатывать их удобным и эффективным способом; * рисовать красивые современные планы и разрезы; * создавать реалистичные 3D-модели пещер.
